Tekla Open API Reference for Tekla Structures 2025
DrawingCreator.CreateDrawings Method (AutoDrawingRule, List<Identifier>, AutoDrawingsStatusEnum)
 Creates drawings using the AutoDrawing tool of Tekla Structures.
 Namespace: Tekla.Structures.Drawing.Automation
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CreateDrawings(
	AutoDrawingRule Rule,
	List<Identifier> aModelObjectIdentifier,
	out AutoDrawingsStatusEnum OperationStatus
)
Public Shared Function CreateDrawings (
	Rule As AutoDrawingRule,
	aModelObjectIdentifier As List(Of Identifier),
	<OutAttribute> ByRef OperationStatus As AutoDrawingsStatusEnum
) As Boolean
Parameters
Rule
Type: Tekla.Structures.Drawing.Automation.AutoDrawingRule
The AutoDrawing rule to be used.
aModelObjectIdentifier
Type: System.Collections.Generic.List<Identifier>
The model object identifier list to be used. Part identifiers to create single part drawings or assembly identifiers to create assembly drawings.
OperationStatus
Type: Tekla.Structures.Drawing.Automation.AutoDrawingsStatusEnum
The operation status to be used.
Return Value
Type: Boolean
True on success.
See Also
Reference
DrawingCreator Class
CreateDrawings Overload
Tekla.Structures.Drawing.Automation Namespace